<a href="https://colab.research.google.com/github/tutalae/PracticePython/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [3]:
data = {
   'ages': [14, 18, 24, 42],
   'heights': [165, 180, 176, 184]
}

In [4]:
df = pd.DataFrame(data)
df

   ages  heights
0    14      165
1    18      180
2    24      176
3    42      184

In [5]:
df = pd.DataFrame(data, index=['James', 'Bob', 'Amy', 'Dave'])
df

       ages  heights
James    14      165
Bob      18      180
Amy      24      176
Dave     42      184

In [6]:
df.loc["Bob"]

ages        18
heights    180
Name: Bob, dtype: int64

In [7]:
df[df.ages >20]

      ages  heights
Amy     24      176
Dave    42      184

In [8]:
print(df["ages"])

James    14
Bob      18
Amy      24
Dave     42
Name: ages, dtype: int64

In [9]:
print(df[["ages","heights"]])

       ages  heights
James    14      165
Bob      18      180
Amy      24      176
Dave     42      184

In [10]:
# third row
print(df.iloc[2])

ages        24
heights    176
Name: Amy, dtype: int64

In [11]:
#first 3 rows
print(df.iloc[:3])

       ages  heights
James    14      165
Bob      18      180
Amy      24      176

In [12]:
# rows 2 to 3
print(df.iloc[1:3])

     ages  heights
Bob    18      180
Amy    24      176

In [13]:
print(df[(df['ages']>18) & (df['heights']>180)])

      ages  heights
Dave    42      184

In [14]:
x = {
'a': [1, 2],
'b': [3, 4],
'c': [5, 6]
}
df = pd.DataFrame(x)

In [15]:
df

   a  b  c
0  1  3  5
1  2  4  6

In [16]:
import pandas as pd

df = pd.read_csv("https://www.sololearn.com/uploads/ca-covid.csv")

df

         date       state  cases  deaths
0    25.01.20  California      1       0
1    26.01.20  California      1       0
2    27.01.20  California      0       0
3    28.01.20  California      0       0
4    29.01.20  California      0       0
..        ...         ...    ...     ...
337  27.12.20  California  37555      62
338  28.12.20  California  41720     246
339  29.12.20  California  34166     425
340  30.12.20  California  32386     437
341  31.12.20  California  32264     574

[342 rows x 4 columns]

In [17]:
df.drop('state', axis=1, inplace=True)

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 342 entries, 0 to 341
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    342 non-null    object
 1   cases   342 non-null    int64
 2   deaths  342 non-null    int64
dtypes: int64(2), object(1)
memory usage: 8.1+ KB

In [18]:
df

         date  cases  deaths
0    25.01.20      1       0
1    26.01.20      1       0
2    27.01.20      0       0
3    28.01.20      0       0
4    29.01.20      0       0
..        ...    ...     ...
337  27.12.20  37555      62
338  28.12.20  41720     246
339  29.12.20  34166     425
340  30.12.20  32386     437
341  31.12.20  32264     574

[342 rows x 3 columns]

In [19]:
df = pd.read_csv("https://www.sololearn.com/uploads/ca-covid.csv")

df.drop('state', axis=1, inplace=True)

df['month'] = pd.to_datetime(df['date'], format="%d.%m.%y").dt.month_name()

df.set_index('date', inplace=True)

print(df.head())

          cases  deaths    month
date
25.01.20      1       0  January
26.01.20      1       0  January
27.01.20      0       0  January
28.01.20      0       0  January
29.01.20      0       0  January

In [20]:
df['cases'].describe()

count      342.000000
mean      6747.862573
std      10023.201267
min          0.000000
25%       1352.250000
50%       3462.500000
75%       7637.250000
max      64987.000000
Name: cases, dtype: float64

In [21]:
print(df['month'].value_counts())

October      31
August       31
December     31
March        31
May          31
July         31
June         30
November     30
September    30
April        30
February     29
January       7
Name: month, dtype: int64

In [22]:
print(df.groupby('month')['cases'].sum())

month
April          41887
August        210268
December     1070577
February          25
January            3
July          270120
June          119039
March           8555
May            62644
November      301944
October       114123
September     108584
Name: cases, dtype: int64

In [23]:
df['cases'].sum()

2307769

In [24]:
data = {
    'a': [1, 2, 3],
    'b': [5, 8, 4]
}
df = pd.DataFrame(data)
df['c'] = df['a']+df['b']
print(df.iloc[2]['c'])

7

In [26]:
df['a']

0    1
1    2
2    3
Name: a, dtype: int64

In [25]:
df['c']

0     6
1    10
2     7
Name: c, dtype: int64